{
  "projects": [
    {
      "name": "Exploring new trends",
      "descriptions": [
        {
          "type": "text",
          "value": "Leisure project with goal to gain knowledge about some of the popular trends."
        }
      ],
      "keywords": [
        "Docker",
        "Kubernetes",
        "VirtualBox",
        "Ubuntu",
        "Deno",
        "PROXY Protocol",
        "NginX",
        "MetalLB",
        "MongoDB Cluster",
        "React Hooks",
        "Typescript",
        "Google APIs"
      ]
    },
    {
      "name": "Price Change Notifier",
      "descriptions": [
        {
          "type": "text",
          "value": "Really simple and really useful background application that notifies clients when price of the ticket is changed. Used two times by now and both times helped in reducing travel cost. Notifications are sent over email."
        }
      ],
      "keywords": [
        "Node",
        "Electron",
        "Web crawler"
      ]
    },
    {
      "name": "Smart Trafic System",
      "descriptions": [
        {
          "type": "text",
          "value": "Inspired by traffic congestions, this application shows a simulation of the intersection, where traffic lights are controlled by the Q-Learning algorithm. The algorithm knows only how many vehicles are in every lane and decides where to turn green light next. Sumo is used for traffic simulation. This system shows better results than Round Robin where there is no uniform traffic flow."
        }
      ],
      "keywords": [
        "Inteligent System",
        "Python",
        "Sumo/TraCI",
        "Q-Learning"
      ]
    },
    {
      "name": "Medical System",
      "descriptions": [
        {
          "type": "text",
          "value": "A Web application that allows medical staff to schedule a medical visit of patients. Data are stored in contracts on ethereum blockchain (Rinkeby test network). Contracts are written in the Solidity programming language. Web3.js and Metamask are used for the front-blockchain connection."
        }
      ],
      "keywords": [
        "React",
        "Redux",
        "Blockchain",
        "Solidity",
        "Smart Contracts",
        "Web3.js",
        "SemanticUI"
      ]
    },
    {
      "name": "Clipboard History Manager",
      "descriptions": [
        {
          "type": "text",
          "value": "Cross-platform (Win, Linux) electron application that runs in background and records every change of clipboard. You can show up the manager window and select which recorded clipboard content you want to paste. An automatic software update also is done."
        }
      ],
      "keywords": [
        "React",
        "Electron",
        "Node",
        "Automatic Software Update",
        "GitHub Releases"
      ]
    },
    {
      "name": "Data Structure Visualization",
      "descriptions": [
        {
          "type": "text",
          "value": "A Web application, built with ReactJS, which helps to easily understand some basic operations on Binary Search Tree and Min/Max Heap by going step by step in a player followed by pseudocode and visual pointers."
        }
      ],
      "keywords": [
        "React",
        "Canvas",
        "Algorithms",
        "BST/Heap"
      ]
    },
    {
      "name": "Hasami Shogi",
      "descriptions": [
        {
          "type": "text",
          "value": "Logical game for two players. Implementation of the Minimax algorithm in programming language lisp. Won third place in the competition computer vs. computer."
        }
      ],
      "keywords": [
        "Lisp",
        "Functional Programming",
        "Minimax algorithm",
        "AI",
        "Competition"
      ]
    },
    {
      "name": "Car Dealership System",
      "descriptions": [
        {
          "type": "text",
          "value": "A Windows application that allows dealers to keep track of clients, sales, repairs, etc. NHibernate ORM is used to connect to the Oracle database."
        }
      ],
      "keywords": [
        "C#",
        "SQL",
        "Oracle Database",
        "ORM",
        "REST API",
        "LINQ",
        "Postman"
      ]
    }
  ]
}